src/main/java/com/amdocs/halo/automation/xmls/manageOrderRequestOA_NS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <ns2:manageOrderRequest xmlns:ns2="http://cio.att.com/order/management/model" xmlns="http://cio.att.com/entity/model" xmlns:ns0="http://cio.att.com/req/model" xmlns:ns1="http://cio.att.com/ord/model">
         <ns2:order>
            <ns0:eid>
               <context>OCX</context>
               <id>{$oaId$}</id>
               <entityType>OrderAction</entityType>
            </ns0:eid>
            <ns0:type>MISS</ns0:type>
            <ns0:characteristics>
               <item>
                  <name>ServiceGroupOrderId</name>
                  <value>{$sgId$}</value>
               </item>
               <item>
                  <name>portService</name>
                  <value>Private Line</value>
                  <!--Ethernet, Private Line-->
               </item>
               <item>
                  <name>circuitType</name>
                  <value>T1</value>
                  <!--T1, 1 Gbps-->
               </item>
               <item>
                  <name>isHybridNetwork</name>
                  <value>false</value>
               </item>
               <item>
                  <name>SORID</name>
                  <value>{$sorId$}</value>
               </item>
            </ns0:characteristics>
            <ns0:associations>
               <item>
                  <associationName>AssociatedSiteOrder</associationName>
                  <items>
                     <item>
                        <context>OCX</context>
                        <id>{$sgId$}</id>
                        <entityType>Order</entityType>
                     </item>
                  </items>
               </item>
               <!--<item>
                  <associationName>AssociatedServiceOrder</associationName>
                  <items>
                     <item>
                        <context>OCX</context>
                        <id>202072001</id>
                        <entityType>OrderAction</entityType>
                        <type>BVFLEX</type>
                        <product>IPFLEX</product>
                     </item>
                  </items>
               </item>-->
            </ns0:associations>
            <ns1:isBundle>false</ns1:isBundle>
            <ns1:actionType>PR</ns1:actionType>
            <ns1:actionSubType>NA</ns1:actionSubType>
            <ns1:version>1</ns1:version>
            <ns1:reasonsList>
               <ns1:reason>
                  <ns1:reasonCode>CREQ</ns1:reasonCode>
               </ns1:reason>
            </ns1:reasonsList>
         </ns2:order>
      </ns2:manageOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>